<a href="https://colab.research.google.com/github/AdepuTejaswini9/B21_1423/blob/main/29aug.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
#create a series from list
data = [10,20,30,40,50]
series = pd.Series(data)
print("pandsa Series:")
print(series)

pandsa Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
#creating a custom index
data=[10,20,30,40,50]
index_labels=['a','b','c','d','e']
series=pd.Series(data,index=index_labels)
print("pandas series:")
print(series)

pandas series:
a    10
b    20
c    30
d    40
e    50
dtype: int64

In [ ]:
#create a data frame
data={
    "name":['alice','bob','charlie','david'],
    "age":[25,30,22,28],
    "city":['new york','san francisco','chicago','los angeles']
}
df=pd.DataFrame(data)
print("pandas dataframe:")
print(df)

pandas dataframe:
      name  age           city
0    alice   25       new york
1      bob   30  san francisco
2  charlie   22        chicago
3    david   28    los angeles

In [ ]:
#accesing Data
#single column
print(df['name'])
#multiple columns
print(df[['name','age']])
#rows using index
print(df.iloc[1])
print(df.loc[2])
#adding a new column
df['Salary'] = [4000,5000,6000,7000]
print(df)
#remove column
df=df.drop('city',axis=1)
print(df)

0      alice
1        bob
2    charlie
3      david
Name: name, dtype: object
      name  age
0    alice   25
1      bob   30
2  charlie   22
3    david   28
name              bob
age                30
city    san francisco
Name: 1, dtype: object
name    charlie
age          22
city    chicago
Name: 2, dtype: object
      name  age           city  Salary
0    alice   25       new york    4000
1      bob   30  san francisco    5000
2  charlie   22        chicago    6000
3    david   28    los angeles    7000
      name  age  Salary
0    alice   25    4000
1      bob   30    5000
2  charlie   22    6000
3    david   28    7000

In [ ]:
#filtering data->select rows where age>30
print(df[df['age']>30])

#Basic stat
print(df['age'].mean())
print(df['age'].max())
print(df['age'].min())

Empty DataFrame
Columns: [name, age, Salary]
Index: []
26.25
30
22

In [ ]:
#student data
#creating a dataframe
student_data={
    'student_id':[1,2,3,4,5],
    'name':['alice','bob','charlie','david','emily'],
    'Marks':[20,22,21,19,23],
    'department':['computer science','engineering','computer science','engineering','computer science']
}
df=pd.DataFrame(student_data)
#display full dataframe
print("student data")
print(df)

#find student
print("\nStudent with marks greater than 20")
print(df[df['Marks']>20])

#Avg marks
print("\nAvg marks",df['Marks'].mean())

#add new column
df['result']=['pass' if marks>=20 else 'fail' for marks in df['Marks']]
print("\nUpdated dataframe")
print(df)

student data
   student_id     name  Marks        department
0           1    alice     20  computer science
1           2      bob     22       engineering
2           3  charlie     21  computer science
3           4    david     19       engineering
4           5    emily     23  computer science

Student with marks greater than 20
   student_id     name  Marks        department
1           2      bob     22       engineering
2           3  charlie     21  computer science
4           5    emily     23  computer science

Avg marks 21.0

Updated dataframe
   student_id     name  Marks        department result
0           1    alice     20  computer science   pass
1           2      bob     22       engineering   pass
2           3  charlie     21  computer science   pass
3           4    david     19       engineering   fail
4           5    emily     23  computer science   pass

In [28]:
stu_data={
    'stu_name':['teju','keerthi','sindhu','shailaja','sanjana'],
    'stu_rollno':[1,2,3,4,5],
    'M1':[90,82,92,95,91],
    'M2':[92,81,92,96,95],
    'M3':[93,85,95,92,97],
}

df = pd.DataFrame(stu_data)

total=df['M1']+df['M2']+df['M3']
df['total']=total

result=['pass' if total>=270 else 'fail' for total in df['total']]
df['result']=result

avg=df['total']/3
df['average']=avg

print(df)

   stu_name  stu_rollno  M1  M2  M3  total result    average
0      teju           1  90  92  93    275   pass  91.666667
1   keerthi           2  82  81  85    248   fail  82.666667
2    sindhu           3  92  92  95    279   pass  93.000000
3  shailaja           4  95  96  92    283   pass  94.333333
4   sanjana           5  91  95  97    283   pass  94.333333